In [1]:
import pandas as pd
import numpy as np

In [2]:
lst = pd.Series([1,2,3,np.nan,6,8])

In [3]:
lst

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20201101',periods=5)
dates

DatetimeIndex(['2020-11-01', '2020-11-02', '2020-11-03', '2020-11-04',
               '2020-11-05'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), columns=list('ABCD'))
df

          A         B         C         D
0  0.616974 -0.835318 -0.494854  0.491683
1 -0.546952  1.972233 -1.073005  0.803277
2  0.891256 -0.186305 -0.049834  0.719219
3  0.419253 -1.161819 -0.111035 -0.563306
4  0.612820  0.217148  1.115112 -1.435646
5  0.777451 -0.277598  0.105554  0.141500

In [6]:
df2 = pd.DataFrame({'A':2,
                    'B':pd.date_range('20201101',periods=4),
                    'C':pd.Series(data=[1,2,3,4],dtype='float32'),
                    'D':np.array([8]*4),
                    'E':pd.Categorical(['A','B','C','D']),
                    'F':'test'   
})

df2

   A          B    C  D  E     F
0  2 2020-11-01  1.0  8  A  test
1  2 2020-11-02  2.0  8  B  test
2  2 2020-11-03  3.0  8  C  test
3  2 2020-11-04  4.0  8  D  test

In [7]:
# get datafram column data types
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
#displaying index
df2.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
#displaying columns
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [10]:
# convert to dictionary 
df.to_dict

<bound method DataFrame.to_dict of           A         B         C         D
0  0.616974 -0.835318 -0.494854  0.491683
1 -0.546952  1.972233 -1.073005  0.803277
2  0.891256 -0.186305 -0.049834  0.719219
3  0.419253 -1.161819 -0.111035 -0.563306
4  0.612820  0.217148  1.115112 -1.435646
5  0.777451 -0.277598  0.105554  0.141500>

In [11]:
df2.to_dict

<bound method DataFrame.to_dict of    A          B    C  D  E     F
0  2 2020-11-01  1.0  8  A  test
1  2 2020-11-02  2.0  8  B  test
2  2 2020-11-03  3.0  8  C  test
3  2 2020-11-04  4.0  8  D  test>

In [12]:
# transpose
df2.T

,0,1,2,3
A,2,2,2,2
B,2020-11-01 00:00:00,2020-11-02 00:00:00,2020-11-03 00:00:00,2020-11-04 00:00:00
C,1,2,3,4
D,8,8,8,8
E,A,B,C,D
F,test,test,test,test

In [13]:
# Sorting rows of dataframe in descending order
df2.sort_index(axis=0,ascending=False)

   A          B    C  D  E     F
3  2 2020-11-04  4.0  8  D  test
2  2 2020-11-03  3.0  8  C  test
1  2 2020-11-02  2.0  8  B  test
0  2 2020-11-01  1.0  8  A  test

In [14]:
# Sorting dataframe by column name
df2.sort_values(by='C',ascending=False)

   A          B    C  D  E     F
3  2 2020-11-04  4.0  8  D  test
2  2 2020-11-03  3.0  8  C  test
1  2 2020-11-02  2.0  8  B  test
0  2 2020-11-01  1.0  8  A  test

In [15]:
# Selecting a column by name
df2['B']

0   2020-11-01
1   2020-11-02
2   2020-11-03
3   2020-11-04
Name: B, dtype: datetime64[ns]

In [16]:
# Selecting rows by slicing
df2[0:2]

   A          B    C  D  E     F
0  2 2020-11-01  1.0  8  A  test
1  2 2020-11-02  2.0  8  B  test

In [17]:
# Selecting 2 rows from a column
df2['A'][:2]

0    2
1    2
Name: A, dtype: int64

In [18]:
# Selecting on a multi-axis by label
df2.loc[:,['A','B']]

   A          B
0  2 2020-11-01
1  2 2020-11-02
2  2 2020-11-03
3  2 2020-11-04

In [19]:
# selecting row based on index number
df2.iloc[3]

A                      2
B    2020-11-04 00:00:00
C                      4
D                      8
E                      D
F                   test
Name: 3, dtype: object

In [20]:
# selecting row based in row label
df2.loc[3]

A                      2
B    2020-11-04 00:00:00
C                      4
D                      8
E                      D
F                   test
Name: 3, dtype: object

In [21]:
# slicing column
df2.iloc[:,1:3]

           B    C
0 2020-11-01  1.0
1 2020-11-02  2.0
2 2020-11-03  3.0
3 2020-11-04  4.0

In [22]:
# accessing an element by row and column value
df2.iat[1,2]

2.0

In [23]:
df2

   A          B    C  D  E     F
0  2 2020-11-01  1.0  8  A  test
1  2 2020-11-02  2.0  8  B  test
2  2 2020-11-03  3.0  8  C  test
3  2 2020-11-04  4.0  8  D  test

In [24]:
# indexing based on a condition 
df2[df2['B']>'2020-11-02']

   A          B    C  D  E     F
2  2 2020-11-03  3.0  8  C  test
3  2 2020-11-04  4.0  8  D  test

In [25]:
# indexing based on a condition
df2[df2['C']>=3]

   A          B    C  D  E     F
2  2 2020-11-03  3.0  8  C  test
3  2 2020-11-04  4.0  8  D  test

In [26]:
# filtering using isin() method
df3 = df2.copy()
df3['G'] = ['Hi', 'I', 'am','Amol']
df3[df3['G'].isin(['Hi'])]

   A          B    C  D  E     F   G
0  2 2020-11-01  1.0  8  A  test  Hi

In [27]:
df3['H'] = [np.nan,1,2,np.nan]

In [28]:
# drop rows with nan
df3.dropna()

   A          B    C  D  E     F   G    H
1  2 2020-11-02  2.0  8  B  test   I  1.0
2  2 2020-11-03  3.0  8  C  test  am  2.0

In [29]:
df3['H'].fillna(5)

0    5.0
1    1.0
2    2.0
3    5.0
Name: H, dtype: float64

In [30]:
# check if the values are nan
df3.isna()

       A      B      C      D      E      F      G      H
0  False  False  False  False  False  False  False   True
1  False  False  False  False  False  False  False  False
2  False  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False   True

In [31]:
# find mean
df = pd.DataFrame(data=np.random.randint(1,100,(3,3)),columns=['A','B','C'])
df.mean()

A    59.666667
B    75.666667
C    33.000000
dtype: float64

In [32]:
df.mean(1)

0    85.666667
1    43.333333
2    39.333333
dtype: float64

In [33]:
# apply using lambda function 
# below is same as 
# def add(x):
#     return x+1
df.apply(lambda x: x+1)

    A   B   C
0  92  92  76
1  28  81  24
2  62  57   2

In [34]:
# get counts 
series = pd.Series(np.random.randint(0, 7, size=10))
series.value_counts()

0    4
1    2
6    1
5    1
3    1
2    1
dtype: int64

In [35]:
# get all the strings to uppercase 
string_series = pd.Series(data=['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
string_series

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [36]:
string_series.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

In [37]:
# get lower case
string_series.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [38]:
# concatening
sr1 = pd.Series(np.random.randint(1,10,5))
sr2 = pd.Series(np.random.randint(1,20,5))
sr3 = pd.Series(np.random.randint(1,30,5))
sr4 = pd.Series(np.random.randint(1,40,5))
df_concat = pd.concat([sr1,sr2,sr3,sr4],axis=1)

In [39]:
df_concat

   0   1   2   3
0  6  15  20   4
1  7  12   2  15
2  1   2  27  24
3  2   5  29  23
4  2  12   6  10

In [40]:
# Joins
left = pd.DataFrame({'key': ['first', 'second'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['first', 'second'], 'rval': [4, 5]})

In [41]:
left

      key  lval
0   first     1
1  second     2

In [42]:
right

      key  rval
0   first     4
1  second     5

In [43]:
pd.merge(left,right,on='key')

      key  lval  rval
0   first     1     4
1  second     2     5

In [44]:
# group by
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                  'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8), 
                   'D': np.random.randn(8)})

In [45]:
df

     A      B         C         D
0  foo    one  1.306896  1.636066
1  bar    one  0.093425  0.993300
2  foo    two  0.247386 -0.444542
3  bar  three  0.145664 -0.485743
4  foo    two -0.571633 -0.477214
5  bar    two  0.513200 -0.561674
6  foo    one  0.041541 -1.244918
7  foo  three  0.678406 -0.930065

In [46]:
df.groupby(by='A').mean()

            C         D
A
bar  0.250763 -0.018039
foo  0.340519 -0.292135

In [47]:
df.groupby(by=['A','B']).sum()

                  C         D
A   B
bar one    0.093425  0.993300
    three  0.145664 -0.485743
    two    0.513200 -0.561674
foo one    1.348437  0.391148
    three  0.678406 -0.930065
    two   -0.324247 -0.921756

In [48]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                      'foo', 'foo', 'qux', 'qux'],
                     ['one', 'two', 'one', 'two',
                      'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [49]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [50]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -0.583483 -1.673746
      two    -0.062896 -1.979252
baz   one    -0.412666  0.522886
      two     0.399574 -1.395473
foo   one    -3.182127  0.118694
      two     0.739021  0.462716
qux   one    -0.690715  0.198716
      two    -1.297282 -1.886629

In [51]:
# Creating pivot tables
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                    'B': ['A', 'B', 'C'] * 4,
                    'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                    'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.271806  0.470530
1     one  B  foo -1.071821  0.363807
2     two  C  foo  0.570103 -1.155165
3   three  A  bar  1.506512 -0.200576
4     one  B  bar  0.073608  0.542185
5     one  C  bar  0.939986 -0.755603
6     two  A  foo -0.775210  0.769491
7   three  B  foo -1.873044 -2.549525
8     one  C  foo  0.618601 -0.312315
9     one  A  bar -0.662194 -0.385298
10    two  B  bar  0.340723 -0.262710
11  three  C  bar -0.623075  0.873812

In [52]:
df.pivot_table(index=['A','B'],columns='C')

                D                   E
C             bar       foo       bar       foo
A     B
one   A -0.662194  0.271806 -0.385298  0.470530
      B  0.073608 -1.071821  0.542185  0.363807
      C  0.939986  0.618601 -0.755603 -0.312315
three A  1.506512       NaN -0.200576       NaN
      B       NaN -1.873044       NaN -2.549525
      C -0.623075       NaN  0.873812       NaN
two   A       NaN -0.775210       NaN  0.769491
      B  0.340723       NaN -0.262710       NaN
      C       NaN  0.570103       NaN -1.155165

In [53]:
# categories
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],
                  "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [54]:
df['grade'] = df['raw_grade'].astype('category')
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [55]:
df['grade'].cat.categories = ['top','med','bottom']
df

   id raw_grade   grade
0   1         a     top
1   2         b     med
2   3         b     med
3   4         a     top
4   5         a     top
5   6         e  bottom

In [56]:
df.groupby(by='grade').sum()

        id
grade
top     10
med      5
bottom   6